 USE [BankSystem]

 INSERT INTO Bank (Name)
 VALUES 
 (N'Belarus Bank'), (N'MTBank'), (N'Alpha-Bank'), (N'Sber Bank'), (N'BelinvestBank');
 GO

 INSERT INTO City (Name)
 VALUES
 (N'Minsk'), (N'Gomel'), (N'Vitebsk'), (N'Mogilev'), (N'Brest'), (N'Grodno');
 GO

 INSERT INTO BranchOffice (Name, CityID, BankID)
 VALUES
 (N'Филиал №1', 1, 1), (N'Филиал №3', 2, 1), (N'Филиал №5', 3, 1), (N'Филиал №8', 4, 1), (N'Филиал №11', 5, 1), (N'Филиал №14', 6, 1),
 (N'Филиал №2', 1, 2), (N'Филиал №6', 2, 2), (N'Филиал №9', 3, 2), (N'Филиал №10', 4, 2),
 (N'Филиал №1', 1, 3), (N'Филиал №2', 2, 3),
 (N'Филиал №1', 1, 4), (N'Филиал №8', 2, 4), (N'Филиал №9', 3, 4), (N'Филиал №10', 4, 4), (N'Филиал №11', 5, 4),
 (N'Филиал №1', 1, 5), (N'Филиал №3', 2, 5), (N'Филиал №4', 3, 5), (N'Филиал №9', 4, 5), (N'Филиал №12', 5, 5), (N'Филиал №16', 6, 5);
 GO

 INSERT INTO SocialStatus (Name)
 VALUES
 (N'Наёмный работник'), (N'Безработный'), (N'Владелец бизнеса и ИП'), (N'Пенсионер'), (N'Льготная категория'), (N'Студент'), (N'Домохозяйка, -ин'), (N'В декретном отпуске');
 GO

 INSERT INTO BankAccount (AccountBalance)
 VALUES
 (1000), (0), (200), (10), (100.1234), (5000), (2500.2033);
 GO

 INSERT INTO Client (Name, Phone, BankID, SocialStatusID, BankAccountId)
 VALUES
 (N'Меркушев Мечислав Ильяович', N'+0 00 0000000', 1, 3, 1),
 (N'Потапов Давид Фролович', N'+0 00 0000001', 2, 4, 2),
 (N'Шаров Герасим Артёмович', N'+0 00 0000002', 3, 5, 3),
 (N'Фомичёва Надежда Иринеевна', N'+0 00 0000003', 4, 2, 4),
 (N'Волкова Романа Иринеевна', N'+0 00 0000004', 5, 7, 5),
 (N'Кондратьев Пантелеймон Павлович', N'+0 00 0000005', 2, 3, 6),
 (N'Быков Харитон Филиппович', N'+0 00 0000006', 4, 1, 7);
 GO

 INSERT INTO BankCard (BankAccountID, CardBalance)
 VALUES
 (1, 200), (1, 300), (2, 0), (2, 0), (2, 0), (5, 50.1234), (6, 1250), (6, 750.5), (7, 2000.2033), (7, 500.0);
 GO